import threading

# 多线程利于IO密集型任务但是不利于CPU密集型任务
# python的多线程实现由于GIL锁导致实际上他是同时只会执行一个线程，每个线程执行一定字节代码然后切换到下一个线程，不断如此
# python实现的线程是真实的线程，但是不是实际并发执行->只是python解释器只能单线程串行执行代码导致的一定限制
# 线程对象 = threading.Thread(target=任务名, args=(参数,), daemon=True) kwargs={参数: 值}
# 打开daemon=True将会创建守护线程，当主进程结束，子进程直接销毁
# 传参顺序和名字要和实际函数名字保持一致
# 还有name线程名和group线程组参数
# 线程对象.start()
# 默认主线程的结束要等待子进程的结束
# 线程对象.setDaemon(True) 也会实现守护线程
# 线程之间的执行是无序的，由CPU的调度来决定，操作系统决定
# 每个线程使用资源的逻辑: 拿资源 -> 操作 -> 返还刷新资源 -> 这样容易产生资源竞争，最后结果不确定
# 为了解决线程之间的资源竞争，我们需要实现线程同步->使用互斥锁
print(threading.current_thread())
mutex = threading.Lock()  # 主线程中创建
mutex.acquire()  # 上锁，函数中上锁
mutex.release()  # 释放锁，函数中释放
# 死锁 -> 一直等待对方释放锁的场景(某个线程拿到锁但是不释放...) -> 在合适的位置释放锁
# 线城是依附在进程中的，进程不共享全局数据，但是线程共享
# 进程是操作系统分配资源的最小单位，线程是CPU调度的最小单元
# python中线程->资源开销小但是不能使用多核
